p51/openfoam/case/0.orig/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  6                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include "include/initialConditions"

dimensions [ 0 2 -2 0 0 0 0 ];

internalField uniform $pressure;

boundaryField
{
    inlet
    {
        type        zeroGradient;
    }

    outlet
    {
        type        fixedValue;
        value       $internalField;
    }
    
    sym
    {
        type        symmetryPlane;
    }

    walls
    {
        type        zeroGradient;
    }
    
    model
    {
        type        zeroGradient;
    }
    
    "proc.*"
    {
        type        processor;
    }
}

// ************************************************************************* //
